** Understanding the unmatched hits on starting with '/api/'

This request can probably be rewritten

#+NAME: audit_entries with uri starting with /api with not op_id
#+BEGIN_SRC sql-mode :results file :file api_no_op_id.results
WITH tmp_requests AS
(
SELECT audit_id, verb,
      (regexp_split_to_array(request_uri,'/+'))[2] AS request_l,
      (regexp_split_to_array(request_uri,'/+'))[3] AS request_m,
      (regexp_split_to_array(request_uri,'/+'))[4] AS request_r,
      request_uri
FROM audit_events
WHERE op_id IS NULL
)
-- SELECT DISTINCT verb, request_uri
-- SELECT DISTINCT verb, request_l, request_m --, request_r
SELECT verb, request_uri
-- request_l, request_m, request_r
-- SELECT  DISTINCT verb, request_l, request_m, request_r
-- SELECT DISTINCT verb, request_l, request_m,
--       (regexp_replace(request_r,'configmaps','AOEUI') AS request_x,
-- -- SELECT DISTINCT verb, request_l, request_r
--SELECT DISTINCT verb, request_uri
FROM tmp_requests
WHERE request_l = 'api'
ORDER BY request_l, request_m, verb;
-- ORDER BY request_l, request_m, request_r, verb
-- ORDER BY request_uri, verb
--ORDER BY request_l, verb
-- LIMIT 200;
#+END_SRC

#+RESULTS: audit_entries with uri starting with /api with not op_id
#+begin_src sql-mode
[[file:api_no_op_id.results]]
#+end_src

#+NAME: watch, get, create a namespaces service account token seem to be missed
#+BEGIN_SRC shell
cat api_no_op_id.results | tail +3 \
  | sed 's/\?.*$//' \
  | sed  -e 'sX-[[:digit:]]\{1,\}/X-D/Xg' \
  | sed -e 'sXnamespaces/.*D/Xnamespaces/{namespace}/Xg' \
  | sed -e 'sX/default/X/{namespace}/Xg' \
  | sed -e 'sX/kube-system/X/{namespace}/Xg' \
  | sed -e 'sXserviceaccounts/.*/tokenXserviceaccounts/{sa}/tokenXg' \
  | sort | uniq
#+END_SRC

#+RESULTS: watch, get, create a namespaces service account token seem to be missed
#+begin_EXAMPLE

(27793 rows)
 create | /api/v1/namespaces/{namespace}/serviceaccounts/{sa}/token
 get    | /api/
 watch  | /api/v1/configmaps
 watch  | /api/v1/endpoints
 watch  | /api/v1/limitranges
 watch  | /api/v1/namespaces
 watch  | /api/v1/namespaces/{namespace}/configmaps
 watch  | /api/v1/namespaces/{namespace}/endpoints
 watch  | /api/v1/namespaces/{namespace}/limitranges
 watch  | /api/v1/namespaces/{namespace}/pods
 watch  | /api/v1/namespaces/{namespace}/replicationcontrollers
 watch  | /api/v1/namespaces/{namespace}/secrets
 watch  | /api/v1/namespaces/{namespace}/serviceaccounts
 watch  | /api/v1/nodes
 watch  | /api/v1/persistentvolumeclaims
 watch  | /api/v1/persistentvolumes
 watch  | /api/v1/pods
 watch  | /api/v1/podtemplates
 watch  | /api/v1/replicationcontrollers
 watch  | /api/v1/resourcequotas
 watch  | /api/v1/secrets
 watch  | /api/v1/serviceaccounts
 watch  | /api/v1/services
#+end_EXAMPLE
